push (@languages, 'ua');

##################################################################
###   ua = Ukraine

#-------------------------------
$msgtxt{'1ua'} = <<_EOF_ ;
This is the Minimalist Mailing List Manager.

Команди можуть бути зазначен? як у тем? листа (одна команда на лист), так
? в т?л? листа (одна й б?льше команд, в одн?й у кожному рядку). Обробка
команд у т?л? листа виробля?ться в тому випадку, якщо тема листа або
порожня, або м?стить команду 'body' (без лапок). Зак?нчу?ться обробка
або у випадку досягнення команди 'stop' або 'exit' (без лапок), або по
одержанн? 10 неправильних команд.

П?дтримуються наступн? команди:

subscribe <list> [<email>] :
    п?дписати користувача на список <list>. Якщо список <list> м?стить
    суф?кс '-writers', користувач може писати в список <list>, але не
    буде одержувати пов?домлення, в?дправлен? в цей список.

unsubscribe <list> [<email>] :
    в?дписатися в?д списку <list>. Може бути використаний ?з суф?ксом
    '-writers' (опис ц??? можливост? див. вище)

auth <code> :
    п?дтверджуюча команда авторизац??. Ця команда н?коли не
    використа?ться сама по соб?, а т?льки у в?дпов?дь на запит менеджера списку
    розсилання.

mode <list> <email> <mode> :
    Установити для зазначеного передплатника параметри в?дправлення й одержання
    пов?домлень розсилання. Команда дозволена т?льки для адм?н?стратора
    розсилання.  Параметр 'mode' може приймати наступн? значення
    (указувати без лапок):
      * 'reader' - передплатник не зможе публ?кувати пов?домлення в розсиланн?;
      * 'writer' - передплатник зможе публ?кувати пов?домлення в розсиланн? нав?ть
                   якщо загальна конф?гурац?я не дозволя? публ?кац?ю;
      * 'usual' - скинути кожну ?з двох зазначених вище настроювань. Права
		  передплатника будуть визначатися загальною конф?гурац??ю
		  розсилання.
      * 'suspend' - призупинити одержання пов?домлень користувачем
      * 'resume' - в?дновити одержання пов?домлень користувачем
      * 'maxsize <size>' - установити максимальний розм?р пов?домлень (в
			   байтах), як? будуть в?дправлятися
			   користувачев? ?з зазначеного розсилання.
      * 'reset' - скинути вс? параметри користувача.
    
suspend <list>:
    призупинити одержання пов?домлень ?з розсилання

resume <list>:
    в?дновити припинене ран?ше командою 'suspend' одержання пов?домлень
    з розсилання

maxsize <list> <size>:
    установити максимальний розм?р пов?домлень (у байтах), як? будуть
    в?дправлятися користувачев? ?з зазначеного розсилання.

which [<email>] :
    одержати перел?к списк?в розсилання, на як? п?дписаний користувач

info [<list>] :
    одержати додаткову ?нформац?ю про ?снуюч? списки розсилання або
    про список <list>

who <list> :
    одержати список передплатник?в на розсилання <list>

help :
    Пов?домлення за допомогою (це пов?домлення)

Зверн?ть увагу, що <email> у вс?х командах ? команди 'who' й 'mode'
можуть бути використан? т?льки адм?н?страторами (користувачами, що пройшли
аутентиф?кац?ю, установлену директивою auth розсилання або глобальним
паролем). У противному випадку команда буде з?гнорована. Пароль повинен
бути зазначений, як фрагмент будь-якого заголовка листа, у такому вид?:

{pwd: list_password}

Наприклад:

To: MML Discussion {pwd: password1235} <mml-general\@kiev.sovam.com>

Цей фрагмент буде вилучений з пов?домлення перед тим, як пов?домлення буде
в?дправлено передплатникам списку розсилання.
_EOF_

#-------------------------------
$msgtxt{'2ua'} = "Помилка:\n\tВи";
$msgtxt{'3ua'} = "не п?дписан? на це розсилання.\n\n".
		 "Р?шення проблеми:\n\tв?дправте пов?домлення за адресою";
$msgtxt{'4ua'} = "з темою\n\t'help' (без лапок) для одержання ?нформац?? про те, як п?дписатися.\n\n".
		 "Дал? йде Ваше пов?домлення:";
#-------------------------------
$msgtxt{'5ua'} = "Помилка:\n\tВи";
$msgtxt{'5.1ua'} = "не можете в?дправляти листа в дане розсилання.\n\n".
		 "Дал? йде Ваше пов?домлення:";
#-------------------------------
$msgtxt{'6ua'} = "Помилка:\n\tдовжина Вашого сообшения б?льше максимально припустимо? (";
$msgtxt{'7ua'} = "байт).\n\nр?шення проблеми:\n\tабо зменшить Ваше пов?домлення, або пошл?ть його,\n\tрозбивши на к?лька менших частин.\n\n".
		 "===========================================================================\n".
		 "Дал? йде Ваше пов?домлення:";
#-------------------------------
$msgtxt{'8ua'} = "\nпомилка:\n\tв наш?й баз? нема? запиту з таким кодом ?дентиф?кац??: ";
$msgtxt{'9ua'} = "\n\nр?шення проблеми:\n\t будь ласка, пошл?ть ваш запит ще раз.\n";

#-------------------------------
$msgtxt{'10ua'} = "\nпомилка:\n\tВи не можете переглянути списки розсилань, на як? п?дписан? ?нш? користувач?.\n".
		  "\nр?шення проблеми:\n\tизвините, Ви не можете це зм?нити :)";
#-------------------------------
$msgtxt{'11ua'} = "\nпоточный список п?дписки користувача на розсилання ";
#-------------------------------
$msgtxt{'12ua'} = "\nпомилка:\n\tтакого списку розсилання не ?сну?";
$msgtxt{'13ua'} = ".\n\nр?шення проблеми:\n\tв?дправте пов?домлення за адресою";
$msgtxt{'14ua'} = "з темою\n\t'info' (без лапок) для одержання списку ?снуючих поштових розсилань.\n";
#-------------------------------
$msgtxt{'15ua'} = "\nпомилка:\n\tВи не можете в даному розсиланн? м?няти статус ?нших користувач?в.\n".
		  "\nр?шення проблеми:\n\tвибачте, Ви не можете це зм?нити :)";
#-------------------------------
$msgtxt{'16ua'} = "\nпомилка:\n\tвибачте, ви не можете послати пов?домлення в цей список розсилання.\n".
		  "\nр?шення проблеми:\n\tВи гада?те, що це нев?рно? Спов?стите про це за адресою ";
#-------------------------------
$msgtxt{'17ua'} = "\nпомилка:\n\tвибачте, Ви не можете в?дписатися в?д цього списку розсилання.\n".
		  "\nр?шення проблеми:\n\tВи гада?те, що це нев?рно? Спов?стите про це за адресою ";
#-------------------------------
$msgtxt{'18ua'} = "Ваш запит";
$msgtxt{'19ua'} = "повинен бути авторизований. Для цього будь ласка пошл?ть ?нший запит за адресою";
$msgtxt{'20ua'} = "(або просто натисн?ть кнопку 'Reply' у ваш?й поштов?й програм?)\nз таким заголовком:";
$msgtxt{'21ua'} = "Ви можете це зробити протягом";
$msgtxt{'22ua'} = "годин з моменту одержання цього листа. По зак?нченн? цього строку запит\nбуде вилучений.\n";
#-------------------------------
$msgtxt{'23ua'} = "\nнижче наведена вся доступна ?нформац?я про";
#-------------------------------
$msgtxt{'24ua'} = "\nу даний момент доступн? наступн? списки розсилання";
#-------------------------------
$msgtxt{'25ua'} = "\nсписок користувач?в, п?дписаних на";
$msgtxt{'25.1ua'} = "\nвсього користувач?в: ";
#-------------------------------
$msgtxt{'26ua'} = "\nпомилка:\n\tВи не можете одержати список користувач?в, п?дписаних на дане розсилання.";
#-------------------------------
$msgtxt{'27.0ua'} = "неправильно оформлений запит або нев?рна команда";
$msgtxt{'27ua'} = "\nпомилка:\n\t".$msgtxt{'27.0ua'}.".\n\nр?шення проблеми:\n\n".$msgtxt{'1ua'};
#-------------------------------
$msgtxt{'28ua'} = "З повагою, Minimalist";
#-------------------------------
$msgtxt{'29ua'} = "Ви вже п?дписан? на групу розсилання";
#-------------------------------
$msgtxt{'30ua'} = "на жаль, л?м?т передплатник?в на дане розсилання вичерпаний (";
#-------------------------------
$msgtxt{'31ua'} = "ви усп?шно п?дписалися на список";
$msgtxt{'32ua'} = ".\n\nбудь ласка, зверн?ть увагу на наступне:\n";
#-------------------------------
$msgtxt{'33ua'} = "Ви не були п?дписан? на список";
$msgtxt{'34ua'} = "з наступно? причини";
$msgtxt{'35ua'} = "Якщо у вас ? питання або пропозиц??, будь ласка, в?дправте ?х адм?н?страторов?\nсписку розсилання";
#-------------------------------
$msgtxt{'36ua'} = "\nкористувач ";
$msgtxt{'37ua'} = " в?дписаний в?д розсилання.\n";
#-------------------------------
$msgtxt{'38ua'} = "\nпомилка обробки Вашого запиту; пов?домлення спрямоване адм?н?страторов?.".
		  "\nбудь ласка, зверн?ть увагу, що п?дписка для ";
$msgtxt{'38.1ua'} = " не зм?нилася в списку розсилання ";
#-------------------------------
$msgtxt{'39ua'} = " не ? заре?строваним передплатником даного списку розсилання.\n";
#-------------------------------
$msgtxt{'40ua'} = "\nшановний(-а)";
#-------------------------------
$msgtxt{'41ua'} = "\nспециф?чн? параметри для передплатника ";
$msgtxt{'42ua'} = " у розсиланн? ";
$msgtxt{'43ua'} = " не встановлен?";
$msgtxt{'43.1ua'} = " публ?кац?я дозволена";
$msgtxt{'43.2ua'} = " публ?кац?я не дозволена";
$msgtxt{'43.3ua'} = " п?дписка припинена";
$msgtxt{'43.4ua'} = " максимальний розм?р пов?домлення (байт): ";
#-------------------------------
$msgtxt{'44ua'} = "\nпомилка:\n\tВам не дозволено м?няти параметри доступу ?нших передплатник?в до розсилання.\n".
		  "\nр?шення:\n\tв?дсутн?.";


